import type { AssignmentInfoMap } from '../types';

export const assignmentInfoMap: AssignmentInfoMap = {
  default: {
    title: '사회 문제 해결을 위한 인공지능 설계',
    topic: '인공지능으로 사회문제를 해결한 사례 시청',
    description:
      '다양한 사례를 통해 인공지능이 사회문제를 해결하기 위해 어떻게 사용되는지 알아보자.\n그리고 다음 과제를 수행해보자.',
    questions: [
      {
        question: '해결하고 싶은 현재 또는 미래 사회의 문제 찾기',
        explanation: [
          ' 평소에 해결하고 싶었던 어떠한 문제가 있는가? 또는 미래 사회에 우리가 부딪히게 될 문제 중 해결하고 싶은 무언가가 있는가? 어떠한 종류의 문제든 본인이 해결하고 싶은 현재 또는 미래 사회의 문제를 찾아서 적어보자.',
        ],
      },
      {
        question: '문제를 해결하기 위한 인공지능 아이디어 제시',
        explanation: [
          '앞에서 찾은 사회 문제를 해결하기 위해 어떤 인공지능이 필요하다고 생각하는지 구체적으로 표현해보자. 상상력을 발휘하는 것은 좋지만 실현가능성도 어느 정도 고려하자.',
        ],
      },
      {
        question:
          '현재 나의 부족한 수학 지식이 무엇인지 파악하고 앞으로의 공부 계획 세우기',
        explanation: [
          '학교에서 배우는 수학의 여러 가지 주제들 중 현재 나는 어떠한 부분이 부족하다고 생각하는지 본인의 약점을 구체적으로 적어보자.',
          '대학교에 진학하여 인공지능과 관련된 수학을 공부하기 위해 현재 학교 수학에서 부족한 부분을 어떻게 보완해야할지, 특히 어떤 부분을 중점적으로 공부해야할지, 앞으로의 수학 공부 계획을 구체적으로 세워보자.',
        ],
      },
    ],
  },
};
